Revit 2027 API
Sketch.Profile Property
Returns the Profile of the Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArrArray Profile { get; }
Public ReadOnly Property Profile As CurveArrArray
	Get
public:
property CurveArrArray^ Profile {
	CurveArrArray^ get ();
}
member Profile : CurveArrArray with get
Property Value
CurveArrArray
Remarks
This property is used to retrieve the Profile of Sketch.
See Also
Reference
Sketch Class
Autodesk.Revit.DB Namespace